#!/usr/bin/env python
# -*- coding: utf-8 -*-

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'Kitkat': [
        {'Магазин': 'Азык_Ордо', 'price': 99.99},
        {'Магазин': 'Тагайбий', 'price': 94.59},
        {'Магазин': 'Ак-Ордо', 'price': 94.99},
        {'Магазин': 'Азык_Ордо', 'price': 99.99},
        {'Магазин': 'Азык_Ордо', 'price': 99.99},
    ],
}
print(sweets)

# Указать надо только по 2 магазина с минимальными ценами

nedvij = {
    "2kom" : [
    {"Mesto": "Sputnik", "prise": 20000.0},
    {"Mesto": "Smu", "price": 300000.0}

    ]
}
print(nedvij)
